# ValidateCurve Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireframeBuilder..::..ValidateCurve Method
WireframeBuilder Class See Also
---
Validates curve to be added to the wireframe shape being constructed. Used by addCurve to validate input. This function may be used to pre-validate the geometry being added to avoid an exception from AddCurve().
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static bool ValidateCurve(
	Curve GCurve
)
```

Visual Basic
---
```text
Public Shared Function ValidateCurve ( _
	GCurve As Curve _
) As Boolean
```

Visual C++
---
```text
public:
static bool ValidateCurve(
	Curve^ GCurve
)
```

# ### Parameters
GCurve
    Type: Autodesk.Revit.DB..::..Curve Curve object to be validated.
# ### Return Value
True is %GCurve% is acceptable as a part of a wireframe shape representation being built.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
WireframeBuilder Class
Autodesk.Revit.DB Namespace